ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/psrm/receiveClaim/ValidCallbackClaim.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soap:Header/>
    <soap:Body>
        <MFFordringIndberet_I xmlns="http://skat.dk/begrebsmodel/2009/01/15/">
            <Kontekst/>
            <FordringhaverSystemIDStruktur>
                <VirksomhedSENummer>15151515</VirksomhedSENummer>
            </FordringhaverSystemIDStruktur>
            <MFLeveranceID>1490866047504</MFLeveranceID>
            <FordringAktionSamling>
                <FordringAktion>
                    <MFAktionKode>TILBAGEKALD</MFAktionKode>
                    <DMIFordringHaverID>1162</DMIFordringHaverID>
                    <AktionValg>
                        <MFTilbagekaldFordringStruktur>
                            <DMIFordringEFIFordringID>1</DMIFordringEFIFordringID>
                            <MFAktionID>CHANGE_MFAktionID</MFAktionID>
                            <HovedFordringTilbagekaldÅrsagStruktur>
                                <HovedFordringTilbageÅrsagKode>FEJL</HovedFordringTilbageÅrsagKode>
                                <HovedFordringTilbageÅrsagBegr>Tilbage Aarsag Begrundelse Tekst
                                </HovedFordringTilbageÅrsagBegr>
                            </HovedFordringTilbagekaldÅrsagStruktur>
                            <DMIFordringVirkningFra>2017-03-26+02:00</DMIFordringVirkningFra>
                        </MFTilbagekaldFordringStruktur>
                    </AktionValg>
                </FordringAktion>
            </FordringAktionSamling>
        </MFFordringIndberet_I>
    </soap:Body>
</soap:Envelope>